ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах/лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах</name>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.лис_КомпонентыЗамеровЛаборатории</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </resources>
  <resources>
    <name>Методика</name>
    <type>
      <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеПоРасчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АктОтбора</name>
    <type>
      <types>DocumentRef.лис_АктОтбораПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаОтбораПробы</name>
    <type>
      <types>CatalogRef.ТочкиКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОпределяемыйПоказатель</name>
    <type>
      <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      <types>CatalogRef.ФакторыФизическогоВоздействия</types>
      <types>CatalogRef.ЗВАтмосфера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах/Forms/ФормаЗаписи/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РасчитатьСреднееЗначение()
	
	Запись.СреднееЗначение = (Запись.ПоказаниеПрибора1 + Запись.ПоказаниеПрибора2 + Запись.ПоказаниеПрибора3 + Запись.ПоказаниеПрибора4 + Запись.ПоказаниеПрибора5) / 5;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	

КонецПроцедуры


&НаКлиенте
Процедура ОбъемПробыПриИзменении(Элемент)

	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора1ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора2ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора3ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора4ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказаниеПрибора5ПриИзменении(Элемент)

	РасчитатьСреднееЗначение();
	
КонецПроцедуры

#КонецОбласти
